#+Title:     SLAT: Example 1 with Collapse Added
#+AUTHOR:    Michael Gauland
#+EMAIL:     michael.gauland@canterbury.ac.nz
#+DATE:      {{{time(%Y-%m-%d %H:%M)}}}
#+DESCRIPTION: 
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:6 num:t toc:4 \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t
#+OPTIONS:   TeX:dvipng LaTeX:dvipng skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   timestamp:t email:t
#+OPTIONS:   ':t
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage{unicode-math}
#+LaTex_header: \usepackage{epstopdf}
#+LATEX_HEADER: \usepackage{register}
#+LATEX_HEADER: \usepackage{bytefield}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{tabulary}
#+LATEX_HEADER: \usepackage[section]{placeins}
#+LATEX_HEADER: \usepackage[htt]{hyphenat}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \lstset{keywordstyle=\color{blue}\bfseries}
#+LATEX_HEADER: \newfontfamily\listingsfont[Scale=.7]{DejaVu Sans Mono}
#+LATEX_HEADER: \lstset{basicstyle=\listingsfont}
#+LATEX_HEADER: \lstset{showspaces=false}
#+LATEX_HEADER: \lstset{columns=fixed}
#+LATEX_HEADER: \lstset{extendedchars=true}
#+LATEX_HEADER: \lstset{frame=shadowbox}
#+LATEX_HEADER: \lstset{basicstyle=\ttfamily}
#+LATEX_HEADER: \definecolor{mygray}{gray}{0.8}
#+LATEX_HEADER: \lstset{rulesepcolor=\color{mygray}}
#+LATEX_HEADER: \lstdefinelanguage{dash}{rulecolor=\color{green},rulesepcolor=\color{mygray},frameround=ffff,backgroundcolor=\color{white}}
#+LATEX_HEADER: \lstdefinelanguage{fundamental}{basicstyle=\ttfamily\scriptsize,rulesepcolor=\color{cyan},frameround=tttt,backgroundcolor=\color{white},breaklines=true}
#+LATEX_HEADER: \usepackage{pst-circ}
#+LATEX_HEADER: \usepackage[hang,small,bf]{caption}
#+LATEX_HEADER: \setlength{\captionmargin}{20pt}
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+STARTUP: overview
#+STARTUP: align
#+STARTUP: noinlineimages
#+PROPERTY: header-args:R  :session *R-1*
#+PROPERTY: header-args    :exports both

\clearpage
* Initialisation
  The code in this section reads in the input data, as well as the results
  produces by the old ("paleo") and new ("neo") versions of SLAT.

  #+BEGIN_SRC R  :results output :exports both
    library(xtable)

    num.edps <- 21
    num.cgs <- 115


    ##Set up variables to make it easier to get to the files:
    paleo.dir = paste("~/SLATv1.15_Public/",
        "example1a_collapse/", sep="")
    results.dir = paste(paleo.dir, "results/", sep="")

    ## Read in the IM data:
    paleo.im <- read.csv(
        paste(results.dir, "im-rate.txt", sep=""),
        skip=3, header=FALSE, sep="")
    names(paleo.im) = c("IM", "lambda")

    neo.im <- read.csv("example1a_im_rate", 
                       header=TRUE, sep="")

    ## Read the EDP-IM data
    paleo.edp.im = list()
    neo.edp.im = list()

    for (i in seq(num.edps)) {
        ## Read data from old SLAT:
        paleo.edp.im[[i]] <- read.csv(
            sprintf("%sedp-im-%d", results.dir, i),
            skip=3, header=FALSE, sep="")
        names(paleo.edp.im[[i]]) = c("IM", "mean.x", "sd.lnx")

        neo.edp.im[[i]] <- read.csv(
            sprintf("example1a_im_edp_%d.txt", i),
            header=TRUE, sep="")
        names(neo.edp.im[[i]]) = c("IM", "mean.x", "sd.lnx")
    }

    ## Read the EDP-Rate data
    paleo.edp.rate = list()
    neo.edp.rate = list()

    for (i in seq(num.edps)) {
        ## Read data from old SLAT:
        paleo.edp.rate[[i]] <- read.csv(
            sprintf("%sedp-%d-rate.txt", results.dir, i),
            skip=3, header=FALSE, sep="")
        names(paleo.edp.rate[[i]]) = c("EDP", "lambda")

        neo.edp.rate[[i]] <- read.csv(
            sprintf("example1a_edp_%d_rate.txt", i),
            header=TRUE, sep="")
        names(neo.edp.rate[[i]]) = c("EDP", "lambda")
    }

    ## Read the colapse-im data:
    paleo.collapse.im <- read.csv(
        paste(results.dir, "collapse-im", sep=""),
        skip=3, header=FALSE, sep="")
    names(paleo.collapse.im) = c("IM", "pCollapse")

    neo.collapse.im <- read.csv("example1a_collapse.txt", 
                                header=TRUE, sep="")
    names(neo.collapse.im) = c("IM", "pCollapse")

    ## Read the Component Group loss data
    paleo.loss.im <- list()
    paleo.loss.edp <- list()
    neo.loss.im <- list()
    neo.loss.edp <- list()

    for (i in seq(num.cgs)) {
        paleo.loss.im[[i]] <- read.csv(
            sprintf("%spg-%s-im", results.dir, i),
            skip=3, header=FALSE, sep="")
        names(paleo.loss.im[[i]]) = c("IM", "mean.x", "sd.lnx")

        neo.loss.im[[i]] <- read.csv(
            sprintf("example1a_loss_%d_im.txt", i),
            header=TRUE, sep="")
        names(neo.loss.im[[i]]) = c("IM", "mean.x", "sd.lnx")

        paleo.loss.edp[[i]] <- read.csv(
            sprintf("%spg-%s-edp", results.dir, i),
            skip=3, header=FALSE, sep="")
        names(paleo.loss.edp[[i]]) = c("EDP", "mean.x", "sd.lnx")

        neo.loss.edp[[i]] <- read.csv(
            sprintf("example1a_loss_%d_edp.txt", i),
            header=TRUE, sep="")
        names(neo.loss.edp[[i]]) = c("EDP", "mean.x", "sd.lnx")
    }


    ## Define a function for comparing data sets, for convenience:
    compare <- function(a, b)  {
        result <-data.frame(Value = c(max(abs(a-b)),
                                mean(abs(a-b)),
                                100 * max(abs(a-b)/a)))
        rownames(result) <- c("max(abs(difference))",
                              "mean(abs(difference))",
                              "percent(abs(difference))")
        return(result)
    }
  #+END_SRC

  #+RESULTS:

\clearpage
* IM
  Compare the IM rate of exceedence as calculated by both versions:
  #+BEGIN_SRC R :results output latex :exports both
    xtable(compare(paleo.im$lambda, neo.im$lambda)
         , caption="Comparison of IM Rate calculations.",
  	 digits=c(5))
  #+END_SRC

  Plot it (Figure [[fig:im-rate]]):
  <<code:im-rate-plot>>
  #+NAME: im-rate
  #+HEADER: :results graphics :exports both
  #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
  #+BEGIN_SRC R
     palette(c("red", "blue"))
     plot(paleo.im$lambda ~ paleo.im$IM, log="xy", 
  	xlab="IM", ylab="lambda", main="IM Rate",
  	type="l", lwd=3, col=1,
  	xlim=c(0.01, 3.0), ylim=c(1E-8, 1E0),
  	pch=25)

    lines(neo.im$lambda ~ neo.im$IM, lwd=1, col=2)

    legend(x="topright",
  	 legend=c("Paleo", "Neo"),
  	 fill=palette())
  #+END_SRC

  #+CAPTION: IM rate comparison ([[code:im-rate-plot][code]]).
  #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
  #+NAME: fig:im-rate
  #+RESULTS: im-rate
  [[file:/tmp/babel-1757XZc/figure-1757hSv.pdf]]

\clearpage
* EDP
** Acceleration
*** EDP-IM Relationship
    Compare the mean and standard deviation calculations for the EDP values
    representing acceleration. For each EDP, this table shows the maximum
    absolute difference between the two programs, the mean absolute difference,
    and the maximum percentage difference for both the mean and standard
    deviation calculations:
    #+BEGIN_SRC R :results output latex :exports both
      edp.columns <- data.frame(
          Index=seq(1, num.edps, 1),
          Label=c("Ground Floor Accel", "2nd Story Drift", "2nd Story Accel",
              "3rd Floor Drift", "3rd Floor Accel", "4th Floor Drift", "4th Floor Accel",
              "5th Floor Drift", "5th Floor Accel", "6th Floor Drift", "6th Floor Accel",
              "7th Floor Drift", "7th Floor Accel", "8th Floor Drift", "8th Floor Accel",
              "9th Floor Drift", "9th Floor Accel", "10th Floor Drift", "10th Floor Accel",
              "Roof Drift", "Roof Accel"),
          stringsAsFactors=FALSE)

      acceleration.cols = edp.columns[seq(1, num.edps, 2),]
      drift.cols = edp.columns[seq(2, num.edps, 2),]

      edp.comparion <- as.data.frame(matrix(nrow=length(acceleration.cols$Index), ncol=7), stringsasfactors=FALSE)
      names(edp.comparion) <- c("Floor", "mean.max", "mean.avg", "mean.pct", "sd.max", "sd.avg", "sd.pct")
      for (i in 1:nrow(acceleration.cols)) {
          index <- acceleration.cols[i,]$Index
          edp.comparion[i,]$Floor <- acceleration.cols[i,]$Label

          temp <- compare(paleo.edp.im[[index]]$mean.x, neo.edp.im[[index]]$mean.x)
          edp.comparion[i,]$mean.max <- temp[1,]
          edp.comparion[i,]$mean.avg <- temp[2,]
          edp.comparion[i,]$mean.pct <- temp[3,]

          temp <- compare(paleo.edp.im[[index]]$sd.lnx, neo.edp.im[[index]]$sd.lnx)
          edp.comparion[i,]$sd.max <- temp[1,]
          edp.comparion[i,]$sd.avg <- temp[2,]
          edp.comparion[i,]$sd.pct <- temp[3,]
      }
      xtable(edp.comparion, 
    	 caption="Comparison of EDP-IM calculations for acceleration EDPs.",
    	 digits=c(5))
    #+END_SRC

    Plot the mean (Figure [[fig:accel-im-mean]]) and standard deviation (Figure [[fig:accel-im-sd-lnx]]):
    #+NAME: accel-im-mean
    #+HEADER: :results graphics :exports both
    #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
    #+BEGIN_SRC R
      palette(rainbow(nrow(acceleration.cols)))

      x.range <- c()
      y.range <- c()
      for (i in acceleration.cols$Index) {
          x.range <-range(x.range, paleo.edp.im[[i]]$IM)
          y.range <-range(y.range, paleo.edp.im[[i]]$mean.x)
      }
      plot(NULL, xlim=x.range, ylim=y.range, 
           xlab="IM", ylab="Mean Acceleration",
           main="Mean Acceleration vs. IM")

      for (i in 1:nrow(acceleration.cols)) {
          index = acceleration.cols[i,]$Index
          lines(paleo.edp.im[[index]]$mean.x ~ paleo.edp.im[[index]]$IM, col=i, lwd=3)

          lines(neo.edp.im[[index]]$mean.x ~ neo.edp.im[[index]]$IM, lwd=1)
      }
      legend(x="topleft", legend=acceleration.cols$Label, fill=palette())
    #+END_SRC

    #+CAPTION: mean(Acceleration EDP) vs. IM ([[accel-im-mean][code]]).
    #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
    #+NAME: fig:accel-im-mean
    #+RESULTS: accel-im-mean
    [[file:/tmp/babel-1757XZc/figure-1757ama.pdf]]

    #+NAME: accel-im-sd-lnx
    #+HEADER: :results graphics :exports both
    #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
    #+BEGIN_SRC R
      palette(rainbow(nrow(acceleration.cols)))

      x.range <- c()
      y.range <- c()
      for (i in acceleration.cols$Index) {
          x.range <-range(x.range, paleo.edp.im[[i]]$IM)
          y.range <-range(y.range, paleo.edp.im[[i]]$sd.lnx)
      }
      plot(NULL, xlim=x.range, ylim=y.range, 
           xlab="IM", ylab="Sd Acceleration",
           main="Sd Acceleration vs. IM")

      for (i in 1:nrow(acceleration.cols)) {
          index = acceleration.cols[i,]$Index
          lines(paleo.edp.im[[index]]$sd.lnx ~ paleo.edp.im[[index]]$IM, col=i, lwd=3)

          lines(neo.edp.im[[index]]$sd.lnx ~ neo.edp.im[[index]]$IM, lwd=1)
      }
      legend(x="topright", legend=acceleration.cols$Label, fill=palette())
    #+END_SRC

    #+CAPTION: SD(ln(Acceleration EDP)) vs. IM ([[accel-im-sd-lnx][code]])
    #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
    #+NAME: fig:accel-im-sd-lnx
    #+RESULTS: accel-im-sd-lnx
    [[file:/tmp/babel-1757XZc/figure-17570Bb.pdf]]

\clearpage
*** Rate Relationship
    Compare the EDP-RATE calculations, for acceleration-type EDPS:
    #+BEGIN_SRC R :results output latex :exports both
      edp.comparion <- as.data.frame(matrix(nrow=length(acceleration.cols$Index), ncol=4), stringsasfactors=FALSE)
      names(edp.comparion) <- c("Floor", "mean", "avg", "pct")
      for (i in 1:nrow(acceleration.cols)) {
          index <- acceleration.cols[i,]$Index
          edp.comparion[i,]$Floor <- acceleration.cols[i,]$Label

	  temp <- compare(paleo.edp.rate[[index]]$lambda, neo.edp.rate[[index]]$lambda)
          edp.comparion[i,]$mean <- temp[1,]
          edp.comparion[i,]$avg <- temp[2,]
          edp.comparion[i,]$pct <- temp[3,]
      }
      xtable(edp.comparion,
         caption="Comparion of EDP-RATE calculations, for acceleration-type EDPs",
	 digits=5)
     #+END_SRC

     #+RESULTS:

     Plot the calculated curves (Figure [[fig:accel-im-lambda]]):
    #+NAME: accel-im-lambda
    #+HEADER: :results graphics :exports both
    #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
    #+BEGIN_SRC R
      palette(rainbow(nrow(acceleration.cols)))

      x.range <- c()
      y.range <- c()
      for (i in acceleration.cols$Index) {
          x.range <-range(x.range, paleo.edp.rate[[i]]$EDP)
          y.range <-range(y.range, paleo.edp.rate[[i]]$lambda)
      }
      plot(NULL, xlim=x.range, ylim=y.range, 
           xlab="EDP", ylab="Lambda",
	   log="y",
           main="Lambda(Acceleration) vs. EDP")

      for (i in 1:nrow(acceleration.cols)) {
          index = acceleration.cols[i,]$Index
          lines(paleo.edp.rate[[index]]$lambda ~ paleo.edp.rate[[index]]$EDP, col=i, lwd=3)

          lines(neo.edp.rate[[index]]$lambda ~ neo.edp.rate[[index]]$EDP, lwd=1)
      }
      legend(x="topright", legend=acceleration.cols$Label, fill=palette())
    #+END_SRC

    #+CAPTION: SD(ln(Acceleration EDP)) vs. IM ([[accel-im-lambda][code]])
    #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
    #+NAME: fig:accel-im-lambda
    #+RESULTS: accel-im-lambda
    [[file:/tmp/babel-1757XZc/figure-17571Ci.pdf]]


** Drift   
*** EDP-IM Relationship
    Compare the mean and standard deviation calculations for the EDP values
    representing drift. For each EDP, this table shows the maximum
    absolute difference between the two programs, the mean absolute difference,
    and the maximum percentage difference for both the mean and standard
    deviation calculations:
    #+BEGIN_SRC R :results output latex :exports both
      edp.comparion <- as.data.frame(matrix(nrow=length(drift.cols$Index), ncol=7), stringsasfactors=FALSE)
      names(edp.comparion) <- c("Floor", "mean.max", "mean.avg", "mean.pct", "sd.max", "sd.avg", "sd.pct")
      for (i in 1:nrow(drift.cols)) {
          index <- drift.cols[i,]$Index
          edp.comparion[i,]$Floor <- drift.cols[i,]$Label

          temp <- compare(paleo.edp.im[[index]]$mean.x, neo.edp.im[[index]]$mean.x)
          edp.comparion[i,]$mean.max <- temp[1,]
          edp.comparion[i,]$mean.avg <- temp[2,]
          edp.comparion[i,]$mean.pct <- temp[3,]

          temp <- compare(paleo.edp.im[[index]]$sd.lnx, neo.edp.im[[index]]$sd.lnx)
          edp.comparion[i,]$sd.max <- temp[1,]
          edp.comparion[i,]$sd.avg <- temp[2,]
          edp.comparion[i,]$sd.pct <- temp[3,]
      }
      xtable(edp.comparion, 
    	 caption="Comparison of EDP-IM calculations for drift EDPs.",
    	 digits=c(5))
    #+END_SRC

    Plot the mean (Figure [[fig:drift-im-mean]]) and standard deviation (Figure [[fig:drift-im-sd-lnx]]):
    #+NAME: drift-im-mean
    #+HEADER: :results graphics
    #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
    #+BEGIN_SRC R
      palette(rainbow(nrow(drift.cols)))

      x.range <- c()
      y.range <- c()
      for (i in drift.cols$Index) {
          x.range <-range(x.range, paleo.edp.im[[i]]$IM)
          y.range <-range(y.range, paleo.edp.im[[i]]$mean.x)
      }
      plot(NULL, xlim=x.range, ylim=y.range, 
           xlab="IM", ylab="Mean Drift",
           main="Mean Drift vs. IM")

      for (i in 1:nrow(drift.cols)) {
          index = drift.cols[i,]$Index
          lines(paleo.edp.im[[index]]$mean.x ~ paleo.edp.im[[index]]$IM, col=i, lwd=3)

          lines(neo.edp.im[[index]]$mean.x ~ neo.edp.im[[index]]$IM, lwd=1)
      }
      legend(x="topleft", legend=drift.cols$Label, fill=palette())
    #+END_SRC

    #+CAPTION: mean(Drift EDP) vs. IM ([[drift-im-mean][code]]).
    #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
    #+NAME: fig:drift-im-mean
    #+RESULTS: drift-im-mean
    [[file:/tmp/babel-1757XZc/figure-1757ama.pdf]]

    #+NAME: drift-im-sd-lnx
    #+HEADER: :results graphics
    #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
    #+BEGIN_SRC R
      palette(rainbow(nrow(drift.cols)))

      x.range <- c()
      y.range <- c()
      for (i in drift.cols$Index) {
          x.range <-range(x.range, paleo.edp.im[[i]]$IM)
          y.range <-range(y.range, paleo.edp.im[[i]]$sd.lnx)
      }
      plot(NULL, xlim=x.range, ylim=y.range, 
           xlab="IM", ylab="Sd Drift",
           main="Sd Drift vs. IM")

      for (i in 1:nrow(drift.cols)) {
          index = drift.cols[i,]$Index
          lines(paleo.edp.im[[index]]$sd.lnx ~ paleo.edp.im[[index]]$IM, col=i, lwd=3)

          lines(neo.edp.im[[index]]$sd.lnx ~ neo.edp.im[[index]]$IM, lwd=1)
      }
      legend(x="topright", legend=drift.cols$Label, fill=palette())
    #+END_SRC

    #+CAPTION: SD(ln(Drift EDP)) vs. IM ([[drift-im-sd-lnx][code]])
    #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
    #+NAME: fig:drift-im-sd-lnx
    #+RESULTS: drift-im-sd-lnx
    [[file:/tmp/babel-1757XZc/figure-17570Bb.pdf]]

\clearpage
*** Rate Relationship
    Compare the EDP-RATE calculations, for drift-type EDPS:
    #+BEGIN_SRC R :results output latex
      edp.comparion <- as.data.frame(matrix(nrow=length(drift.cols$Index), ncol=4), stringsasfactors=FALSE)
      names(edp.comparion) <- c("Floor", "mean", "avg", "pct")
      for (i in 1:nrow(drift.cols)) {
          index <- drift.cols[i,]$Index
          edp.comparion[i,]$Floor <- drift.cols[i,]$Label

	  temp <- compare(paleo.edp.rate[[index]]$lambda, neo.edp.rate[[index]]$lambda)
          edp.comparion[i,]$mean <- temp[1,]
          edp.comparion[i,]$avg <- temp[2,]
          edp.comparion[i,]$pct <- temp[3,]
      }
      xtable(edp.comparion,
         caption="Comparion of EDP-RATE calculations, for drift-type EDPs",
	 digits=5)
     #+END_SRC

     #+RESULTS:

     Plot the calculated curves (Figure [[fig:drift-im-lambda]]):
    #+NAME: drift-im-lambda
    #+HEADER: :results graphics
    #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
    #+BEGIN_SRC R
      palette(rainbow(nrow(drift.cols)))

      x.range <- c()
      y.range <- c()
      for (i in drift.cols$Index) {
          x.range <-range(x.range, paleo.edp.rate[[i]]$EDP)
          y.range <-range(y.range, paleo.edp.rate[[i]]$lambda)
      }
      plot(NULL, xlim=x.range, ylim=y.range, 
           xlab="EDP", ylab="Lambda",
	   log="y",
           main="Lambda(Drift) vs. EDP")

      for (i in 1:nrow(drift.cols)) {
          index = drift.cols[i,]$Index
          lines(paleo.edp.rate[[index]]$lambda ~ paleo.edp.rate[[index]]$EDP, col=i, lwd=3)

          lines(neo.edp.rate[[index]]$lambda ~ neo.edp.rate[[index]]$EDP, lwd=1)
      }
      legend(x="topright", legend=drift.cols$Label, fill=palette())
    #+END_SRC

    #+CAPTION: SD(ln(Drift EDP)) vs. IM ([[drift-im-lambda][code]])
    #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
    #+NAME: fig:drift-im-lambda
    #+RESULTS: drift-im-lambda
    [[file:/tmp/babel-1757XZc/figure-17571Ci.pdf]]

* COLLAPSE
  Compare the two versions:
  #+BEGIN_SRC R :results output latex
    xtable(compare(paleo.collapse.im$pCollapse,
    	       neo.collapse.im$pCollapse),
  	 caption="Comparison of Collapse-IM calculations.",
  	 digits=c(5))
  #+END_SRC

  #+RESULTS:

  Plot it the collapse curves:
  #+NAME: collapse-im
  #+HEADER: :results graphics
  #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
  #+BEGIN_SRC R 
    palette(c("red", "blue"))
    plot(paleo.collapse.im$pCollapse ~ paleo.collapse.im$IM, 
         log="", lwd=5,
         xlab="IM", ylab="pCollapse", main="COLLAPSE Rate",
         type="p", col=1)

    lines(neo.collapse.im$pCollapse ~ neo.collapse.im$IM, 
        col=2, lwd=3)

    legend(x="right",
         legend=c("Paleo", "Neo"),
         fill=palette())
  #+END_SRC

  #+CAPTION: Probability of Collapse calculations
  #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
  #+NAME: fig:collapse-im
  #+RESULTS: collapse-im
  [[file:/tmp/babel-1757XZc/figure-1757lVt.pdf]]

  The overall rate of collapse:
  #+BEGIN_SRC R  :results value 
    paleo.rate <- scan(paste(results.dir, "collapse-rate", 
                             sep=""), skip=3)
    neo.rate <- as.numeric(scan("example1a_collrate.txt", 
                                what="string")[8])
    paste(
        sprintf("Paleo: %5.3e; Neo: %5.3e; error: %3.2f%%", 
                paleo.rate,
                neo.rate, 
                (100*abs(neo.rate - paleo.rate)/paleo.rate)),
        sep="\n")
  #+END_SRC
  
  #+RESULTS:
  : Paleo: 2.125e-04; Neo: 2.159e-04; error: 1.57%

\clearpage
* Component Groups
** Acceleration
*** Loss-EDP Relation
#+BEGIN_SRC R :results output latex :exports both
  cgs.descrip <- data.frame(
      matrix(c(1, 2, 2, 20,  2, 2, 2, 18,  3, 2, 4, 4,  4, 2, 4, 18, 
               5, 2, 6, 4,  6, 2, 6, 18,  7, 2, 8, 4,  8, 2, 8, 18, 
               9, 2, 10, 4,  10, 2, 10, 18,  11, 2, 12, 4,  12, 2, 12, 18, 
               13, 2, 14, 4,  14, 2, 14, 18,  15, 2, 16, 4,  16, 2, 16, 18, 
               17, 2, 18, 4,  18, 2, 18, 18,  19, 2, 20, 4,  20, 2, 20, 18, 
               21, 3, 2, 16,  22, 3, 4, 16,  23, 3, 6, 16,  24, 3, 8, 16, 
               25, 3, 10, 16,  26, 3, 12, 16,  27, 3, 14, 16,  28, 3, 16, 16, 
               29, 3, 18, 16,  30, 3, 20, 16,  31, 105, 2, 721,  32, 105, 4, 721, 
               33, 105, 6, 721,  34, 105, 8, 721,  35, 105, 10, 721,  36, 105, 12, 721, 
               37, 105, 14, 721,  38, 105, 16, 721,  39, 105, 18, 721,  40, 105, 20, 721, 
               41, 107, 2, 99,  42, 107, 4, 99,  43, 107, 6, 99,  44, 107, 8, 99, 
               45, 107, 10, 99,  46, 107, 12, 99,  47, 107, 14, 99,  48, 107, 16, 99, 
               49, 107, 18, 99, 50, 107, 20, 99, 51, 203, 3, 693, 52, 203, 5, 693, 
               53, 203, 7, 693, 54, 203, 9, 693, 55, 203, 11, 693, 56, 203, 13, 693, 
               57, 203, 15, 693, 58, 203, 17, 693, 59, 203, 19, 693, 60, 203, 21, 693, 
               61, 211, 3, 23, 62, 211, 5, 23, 63, 211, 7, 23, 64, 211, 9, 23, 
               65, 211, 11, 23, 66, 211, 13, 23, 67, 211, 15, 23, 68, 211, 17, 23, 
               69, 211, 19, 23, 70, 211, 21, 23, 71, 208, 1, 53, 72, 208, 3, 53, 
               73, 208, 5, 53, 74, 208, 7, 53, 75, 208, 9, 53, 76, 208, 11, 53, 
               77, 208, 13, 53, 78, 208, 15, 53, 79, 208, 17, 53, 80, 208, 19, 53, 
               81, 209, 5, 16, 82, 209, 11, 16, 83, 209, 19, 16, 84, 205, 21, 4, 
               85, 204, 1, 2, 86, 106, 2, 721, 87, 106, 4, 721, 88, 106, 6, 721, 
               89, 106, 8, 721, 90, 106, 10, 721, 91, 106, 12, 721, 92, 106, 14, 721, 
               93, 106, 16, 721, 94, 106, 18, 721, 95, 106, 20, 721, 96, 108, 2, 10, 
               97, 108, 4, 10, 98, 108, 6, 10, 99, 108, 8, 10, 100, 108, 10, 10, 
               101, 108, 12, 10, 102, 108, 14, 10, 103, 108, 16, 10, 104, 108, 18, 10, 
               105, 108, 20, 10, 106, 214, 1, 10, 107, 214, 3, 10, 108, 214, 5, 10, 
               109, 214, 7, 10, 110, 214, 9, 10, 111, 214, 11, 10, 112, 214, 13, 10, 
               113, 214, 15, 10, 114, 214, 17, 10, 115, 214, 19, 10 ),
             ncol=4, byrow=TRUE)
  )
  names(cgs.descrip) <- c("Index", "Type", "EDP", "Quantity")
  component.types <- levels(factor(cgs.descrip$Type))

  cg.summary <- as.data.frame(matrix(nrow=num.cgs, ncol=6))
  names(cg.summary) <- c("mean.max", "mean.avg", "mean.pct", "sd.max", "sd.avg", "sd.pct")
  for (i in 1:num.cgs) {
      temp <- compare(paleo.loss.im[[i]]$mean.x, neo.loss.im[[i]]$mean.x)
      cg.summary[i,]$mean.max <= temp[1,]
      cg.summary[i,]$mean.avg <= temp[2,]
      cg.summary[i,]$mean.pct <= temp[3,]

      temp <- compare(paleo.loss.im[[i]]$sd.lnx, neo.loss.im[[i]]$sd.lnx)
      cg.summary[i,]$sd.max <= temp[1,]
      cg.summary[i,]$sd.avg <= temp[2,]
      cg.summary[i,]$sd.pct <= temp[3,]
  }

  for (i in component.types) {
      print(sprintf("%s: %d", i, nrow(cgs.descrip[cgs.descrip$Type == i,])))
      for (j in cgs.descrip[cgs.descrip$Type == i,]$Index) {
          print(cg.summary[cgs.descrip$Type[j],]$Index)
      }
  }

#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
[1] "2: 20"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "3: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "105: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "106: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "107: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "108: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "203: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "204: 1"
NULL
[1] "205: 1"
NULL
[1] "208: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "209: 3"
NULL
NULL
NULL
[1] "211: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
[1] "214: 10"
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
NULL
#+END_EXPORT


      cg.summary <- data.frame(Index=seq(1, num.cgs, 1),
      edp.columns <- data.frame(
          Index=seq(1, num.edps, 1),
          Label=c("Ground Floor Accel", "2nd Story Drift", "2nd Story Accel",
              "3rd Floor Drift", "3rd Floor Accel", "4th Floor Drift", "4th Floor Accel",
              "5th Floor Drift", "5th Floor Accel", "6th Floor Drift", "6th Floor Accel",
              "7th Floor Drift", "7th Floor Accel", "8th Floor Drift", "8th Floor Accel",
              "9th Floor Drift", "9th Floor Accel", "10th Floor Drift", "10th Floor Accel",
              "Roof Drift", "Roof Accel"),
          stringsAsFactors=FALSE)

      acceleration.cols = edp.columns[seq(1, num.edps, 2),]
      drift.cols = edp.columns[seq(2, num.edps, 2),]

      edp.comparion <- as.data.frame(matrix(nrow=length(acceleration.cols$Index), ncol=7), stringsasfactors=FALSE)
      names(edp.comparion) <- c("Floor", "mean.max", "mean.avg", "mean.pct", "sd.max", "sd.avg", "sd.pct")
      for (i in 1:nrow(acceleration.cols)) {
          index <- acceleration.cols[i,]$Index
          edp.comparion[i,]$Floor <- acceleration.cols[i,]$Label

          temp <- compare(paleo.edp.im[[index]]$mean.x, neo.edp.im[[index]]$mean.x)
          edp.comparion[i,]$mean.max <- temp[1,]
          edp.comparion[i,]$mean.avg <- temp[2,]
          edp.comparion[i,]$mean.pct <- temp[3,]

          temp <- compare(paleo.edp.im[[index]]$sd.lnx, neo.edp.im[[index]]$sd.lnx)
          edp.comparion[i,]$sd.max <- temp[1,]
          edp.comparion[i,]$sd.avg <- temp[2,]
          edp.comparion[i,]$sd.pct <- temp[3,]
      }
      xtable(edp.comparion, 
    	 caption="Comparison of EDP-IM calculations for acceleration EDPs.",
    	 digits=c(5))
    #+END_SRC

*** Loss-IM Relation
* PG #1
** LOSS-IM
   Read the LOSS-IM data for group #1:
   #+BEGIN_SRC R   :results output
     paleo.loss1.im <- read.csv(
         paste(results.dir, "pg-1-im", sep=""),
         skip=3, header=FALSE, sep="")
     names(paleo.loss1.im) = c("IM", "mean_x", "sd_ln_x")

     neo.loss1.im <- read.csv("example1a_loss_1_im.txt", 
         header=TRUE, sep="")
   #+END_SRC
  
   #+RESULTS:

   Compare the mean error:
   #+BEGIN_SRC R 
     diff <- paleo.loss1.im$mean_x - neo.loss1.im$mean_x
     denom <- paleo.loss1.im$mean_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+RESULTS:
   | Max abs(error) is 2.100e-01 (1.06%). |
   | Mean error is -1.241e-02 (-0.06%).   |

   Plot the mean (Figures [[fig:loss1.im-mean]] and [[fig:loss1.im-mean-zoom]]):
   #+NAME: loss1.im-mean
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue"))
     plot(paleo.loss1.im$mean_x ~ paleo.loss1.im$IM, log="y", 
          xlab="IM", ylab="Mean Loss",
	  main="Loss-IM Relationship",
          type="p", col=1, lwd=5)

     lines(neo.loss1.im$mean_x ~ neo.loss1.im$IM, col=2, lwd=3)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-IM calculations (Group #1)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss1.im-mean
   #+RESULTS: loss1.im-mean
   [[file:/tmp/babel-1752Epe/figure-1752u3v.pdf]]

   #+NAME: loss1.im-mean-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue"))
     plot(paleo.loss1.im$mean_x ~ paleo.loss1.im$IM, log="y", 
          xlab="IM", ylab="Mean Loss",
	  main="Loss-IM Relationship",
	  xlim=c(0.001, 0.10), ylim=c(1, 20),
          type="p", col=1)

     lines(neo.loss1.im$mean_x ~ neo.loss1.im$IM, col=2)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-IM calculations (Group #1)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss1.im-mean-zoom
   #+RESULTS: loss1.im-mean-zoom
   [[file:/tmp/babel-1752Epe/figure-1752POp.pdf]]

   #+BEGIN_SRC R 
     diff <- paleo.loss1.im$sd_ln_x - neo.loss1.im$sd_ln_x
     denom <- paleo.loss1.im$sd_ln_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC


   #+NAME: loss1.im-sd
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss1.im$sd_ln_x ~ paleo.loss1.im$IM, log="", 
          xlab="IM", ylab="sd(ln(Loss))", 
          main="Loss-IM Relationship",
          type="p", col=1)

     lines(neo.loss1.im$sd_ln_x ~ neo.loss1.im$IM, col=2)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: LOSS1.IM rate calculations (Group #1)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss1.im-sd
   #+RESULTS: loss1.im-sd
   [[file:/tmp/babel-1752Epe/figure-17521AR.pdf]]

** LOSS-EDP
   Read the LOSS-EDP data for group #1:
   #+BEGIN_SRC R   :results output
     paleo.loss1.edp <- read.csv(
         paste(results.dir, "pg-1-edp", sep=""),
         skip=3, header=FALSE, sep="")
     names(paleo.loss1.edp) = c("EDP", "mean_x", "sd_ln_x")

     neo.loss1.edp <- read.csv("example1a_loss_1_edp.txt", 
         header=TRUE, sep="")
   #+END_SRC
  
   Compare the means and standard deviations:
   #+BEGIN_SRC R 
     diff <- paleo.loss1.edp$mean_x - neo.loss1.edp$mean_x
     denom <- paleo.loss1.edp$mean_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+BEGIN_SRC R 
     diff <- paleo.loss1.edp$sd_ln_x - neo.loss1.edp$sd_ln_x
     denom <- paleo.loss1.edp$sd_ln_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   Plot the mean (Figures [[fig:loss1.edp-mean]] and [[fig:loss1.edp-mean-zoom]]) and
   standard deviation (Figure [[fig:loss1.edp-sd]]):
   #+NAME: loss1.edp-mean
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R
     palette(c("red", "blue", "green"))
     plot(paleo.loss1.edp$mean_x ~ paleo.loss1.edp$EDP, log="xy", 
          xlab="EDP", ylab="Mean(Loss)",
          main="Loss-EDP Relationship",
          type="p", col=1, lwd=5)

     lines(neo.loss1.edp$mean_x ~ neo.loss1.edp$EDP, 
         col=2, lwd=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC
   #+CAPTION: Loss-EDP rate calculations (group #1)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss1.edp-mean
   #+RESULTS: loss1.edp-mean
   [[file:/tmp/babel-1752Epe/figure-17529OM.pdf]]

   #+NAME: loss1.edp-mean-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss1.edp$mean_x ~ paleo.loss1.edp$EDP, log="xy", 
          xlab="EDP", ylab="Mean(Loss)",
	  main="Loss-EDP Relationship",
          xlim=c(0.05, 0.10),
          type="p", col=1, lwd=5)

     lines(neo.loss1.edp$mean_x ~ neo.loss1.edp$EDP, 
  	 col=2, lwd=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC
l
   #+CAPTION: Loss-EDP rate calculations (group #1)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss1.edp-mean-zoom
   #+RESULTS: loss1.edp-mean-zoom
   [[file:/tmp/babel-1752Epe/figure-1752KgG.pdf]]



   #+NAME: loss1.edp-sd
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss1.edp$sd_ln_x ~ paleo.loss1.edp$EDP, log="", 
          xlab="EDP", ylab="sd(ln(Loss))",
	  main="Loss-EDP Relationship",
          type="p", col=1, lwd=5)

     lines(neo.loss1.edp$sd_ln_x ~ neo.loss1.edp$EDP, 
  	 col=2, lwd=3)

     points(paleo.loss1.edp$sd_ln_x ~ paleo.loss1.edp$EDP, col=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-EDP calculations
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss1.edp-sd
   #+RESULTS: loss1.edp-sd
   [[file:/tmp/babel-1752Epe/figure-1752-If.pdf]]


\clearpage
* PG #2
** LOSS-IM
   Read the LOSS-IM data for group #2:
   #+BEGIN_SRC R   :results output
     paleo.loss2.im <- read.csv(
         paste(results.dir, "pg-2-im", sep=""),
         skip=3, header=FALSE, sep="")
     names(paleo.loss2.im) = c("IM", "mean_x", "sd_ln_x")

     neo.loss2.im <- read.csv("example1a_loss_2_im.txt", 
         header=TRUE, sep="")
   #+END_SRC
  
   #+RESULTS:

   Compare the means and standard deviations:
   #+BEGIN_SRC R 
     diff <- paleo.loss2.im$mean_x - neo.loss2.im$mean_x
     denom <- paleo.loss2.im$mean_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+BEGIN_SRC R 
     diff <- paleo.loss2.im$sd_ln_x - neo.loss2.im$sd_ln_x
     denom <- paleo.loss2.im$sd_ln_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+RESULTS:
   | Max abs(error) is 5.763e+00 (100.00%). |
   | Mean error is 7.713e-02 (1.43%).       |



   Plot the mean (Figures [[fig:loss2.im-mean]] and [[fig:loss2.im-mean-zoom]]) and
   standard deviation (Figures [[fig:loss2.im-sd]] and [[fig:loss2.im-sd-zoom]]):
   #+NAME: loss2.im-mean
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss2.im$mean_x ~ paleo.loss2.im$IM, log="y", 
          xlab="IM", ylab="Mean Loss",
	  main="Loss-IM Relationship",
          type="p", col=1, lwd=5)

     lines(neo.loss2.im$mean_x ~ neo.loss2.im$IM, col=2, lwd=3)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-IM calculations (group #2)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss2.im-mean
   #+RESULTS: loss2.im-mean
   [[file:/tmp/babel-1752Epe/figure-1752h0d.pdf]]

   #+NAME: loss2.im-mean-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss2.im$mean_x ~ paleo.loss2.im$IM, log="y", 
          xlab="IM", ylab="Mean Loss",
	  main="Loss-IM Relationship",
	  xlim=c(0.10, 0.30), 
          type="p", col=1)

     lines(neo.loss2.im$mean_x ~ neo.loss2.im$IM, col=2)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-IM calculations (group #2)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss2.im-mean-zoom
   #+RESULTS: loss2.im-mean-zoom
   [[file:/tmp/babel-1752Epe/figure-1752LaZ.pdf]]


   #+NAME: loss2.im-sd
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss2.im$sd_ln_x ~ paleo.loss2.im$IM, log="", 
          xlab="IM", ylab="sd(ln(Loss))", 
          main="Loss-IM Relationship",
          type="p", col=1)

     lines(neo.loss2.im$sd_ln_x ~ neo.loss2.im$IM, col=2)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: LOSS2.IM rate calculations (group #2)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss2.im-sd
   #+RESULTS: loss2.im-sd
   [[file:/tmp/babel-1752Epe/figure-17521hg.pdf]]

   #+NAME: loss2.im-sd-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss2.im$sd_ln_x ~ paleo.loss2.im$IM, log="", 
          xlab="IM", ylab="sd(ln(Loss))",
	  xlim=c(0.01, 0.30),
          main="Loss-IM Relationship",
          type="p", col=1)

     lines(neo.loss2.im$sd_ln_x ~ neo.loss2.im$IM, col=2)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: LOSS2.IM rate calculations (group #2)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss2.im-sd-zoom
   #+RESULTS: loss2.im-sd-zoom
   [[file:/tmp/babel-1752Epe/figure-1752P9g.pdf]]

** LOSS-EDP
   Read the LOSS-EDP data for group #2:
   #+BEGIN_SRC R   :results output
     paleo.loss2.edp <- read.csv(
         paste(results.dir, "pg-2-edp", sep=""),
         skip=3, header=FALSE, sep="")
     names(paleo.loss2.edp) = c("EDP", "mean_x", "sd_ln_x")

     neo.loss2.edp <- read.csv("example1a_loss_2_edp.txt", 
         header=TRUE, sep="")
   #+END_SRC
  
   #+RESULTS:

   Compare the means and standard deviations:
   #+BEGIN_SRC R 
     diff <- paleo.loss2.edp$mean_x - neo.loss2.edp$mean_x
     denom <- paleo.loss2.edp$mean_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+RESULTS:
   | Max abs(error) is 5.000000e-05 (0.03%). |
   | Mean error is 1.506201e-06 (0.00%).     |

   #+BEGIN_SRC R 
     diff <- paleo.loss2.edp$sd_ln_x - neo.loss2.edp$sd_ln_x
     denom <- paleo.loss2.edp$sd_ln_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+RESULTS:
   | Max abs(error) is 5.000000e-04 (0.05%). |
   | Mean error is 4.953020e-06 (0.00%).     |

   Plot the means (Figures [[fig:loss2.edp-mean]] and [[fig:loss2.edp-mean-zoom]]) and
   standard deviation (Figures [[fig:loss2.edp-sd]] and [[fig:loss2.edp-sd-zoom]]):
   #+NAME: loss2.edp-mean
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R
     palette(c("red", "blue", "green"))
     plot(paleo.loss2.edp$mean_x ~ paleo.loss2.edp$EDP, log="xy", 
          xlab="EDP", ylab="Mean(Loss)",
          main="Loss-EDP Relationship",
          type="p", col=1, lwd=5)

     lines(neo.loss2.edp$mean_x ~ neo.loss2.edp$EDP, 
         col=2, lwd=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-EDP rate calculations (group #2)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss2.edp-mean
   #+RESULTS: loss2.edp-mean
   [[file:/tmp/babel-1752Epe/figure-1752NDI.pdf]]

   #+NAME: loss2.edp-mean-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss2.edp$mean_x ~ paleo.loss2.edp$EDP, log="xy", 
          xlab="EDP", ylab="Mean(Loss)",
	  main="Loss-EDP Relationship",
          xlim=c(0.05, 0.10),
          type="p", col=1, lwd=5)

     lines(neo.loss2.edp$mean_x ~ neo.loss2.edp$EDP, 
  	 col=2, lwd=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC
   #+CAPTION: Loss-EDP rate calculations (group #2)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss2.edp-mean-zoom
   #+RESULTS: loss2.edp-mean-zoom
   [[file:/tmp/babel-1752Epe/figure-1752_Cy.pdf]]



   #+NAME: loss2.edp-sd
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss2.edp$sd_ln_x ~ paleo.loss2.edp$EDP, log="", 
          xlab="EDP", ylab="sd(ln(Loss))",
	  main="Loss-EDP Relationship",
          type="p", col=1, lwd=5)
     lines(neo.loss2.edp$sd_ln_x ~ neo.loss2.edp$EDP, 
  	 col=2, lwd=3)

     points(paleo.loss2.edp$sd_ln_x ~ paleo.loss2.edp$EDP, col=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-EDP calculations (group #2)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss2.edp-sd
   #+RESULTS: loss2.edp-sd
   [[file:/tmp/babel-1752Epe/figure-1752ofP.pdf]]


   #+NAME: loss2.edp-sd-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R 
     palette(c("red", "blue", "green"))
     plot(paleo.loss2.edp$sd_ln_x ~ paleo.loss2.edp$EDP, log="", 
          xlab="EDP", ylab="sd(ln(Loss))",
	  main="Loss-EDP Relationship",
          xlim=c(0.08, 0.12),
          type="p", col=1, lwd=5)

     lines(neo.loss2.edp$sd_ln_x ~ neo.loss2.edp$EDP, 
  	 col=2, lwd=3)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-EDP calculations (group #2)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss2.edp-sd-zoom
   #+RESULTS: loss2.edp-sd-zoom
   [[file:/tmp/babel-1752Epe/figure-1752MUs.pdf]]

\clearpage
* PG #31
** LOSS-IM
   Read the LOSS-IM data for group #31:
   #+BEGIN_SRC R   :results output
     paleo.loss31.im <- read.csv(
         paste(results.dir, "pg-31-im", sep=""),
         skip=3, header=FALSE, sep="")
     names(paleo.loss31.im) = c("IM", "mean_x", "sd_ln_x")

     neo.loss31.im <- read.csv("example1a_loss_31_im.txt", 
         header=TRUE, sep="")
   #+END_SRC
  
   #+RESULTS:

   Compare the means and standard deviations:
   #+BEGIN_SRC R 
     diff <- paleo.loss31.im$mean_x - neo.loss31.im$mean_x
     denom <- paleo.loss31.im$mean_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+BEGIN_SRC R 
     diff <- paleo.loss31.im$sd_ln_x - neo.loss31.im$sd_ln_x
     denom <- paleo.loss31.im$sd_ln_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+RESULTS:
   | Max abs(error) is 5.763e+00 (100.00%). |
   | Mean error is 7.713e-02 (1.43%).       |



   Plot the mean (Figures [[fig:loss31.im-mean]] and [[fig:loss31.im-mean-zoom]]) and
   standard deviation (Figures [[fig:loss31.im-sd]] and [[fig:loss31.im-sd-zoom]]):
   #+NAME: loss31.im-mean
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss31.im$mean_x ~ paleo.loss31.im$IM, log="y", 
          xlab="IM", ylab="Mean Loss",
	  main="Loss-IM Relationship",
          type="p", col=1, lwd=5)

     lines(neo.loss31.im$mean_x ~ neo.loss31.im$IM, col=2, lwd=3)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-IM calculations (group #31)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss31.im-mean
   #+RESULTS: loss31.im-mean
   [[file:/tmp/babel-1752Epe/figure-1752h0d.pdf]]

   #+NAME: loss31.im-mean-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss31.im$mean_x ~ paleo.loss31.im$IM, log="y", 
          xlab="IM", ylab="Mean Loss",
	  main="Loss-IM Relationship",
	  xlim=c(0.10, 0.30), 
          type="p", col=1)

     lines(neo.loss31.im$mean_x ~ neo.loss31.im$IM, col=2)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-IM calculations (group #31)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss31.im-mean-zoom
   #+RESULTS: loss31.im-mean-zoom
   [[file:/tmp/babel-1752Epe/figure-1752LaZ.pdf]]


   #+NAME: loss31.im-sd
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss31.im$sd_ln_x ~ paleo.loss31.im$IM, log="", 
          xlab="IM", ylab="sd(ln(Loss))", 
          main="Loss-IM Relationship",
          type="p", col=1)

     lines(neo.loss31.im$sd_ln_x ~ neo.loss31.im$IM, col=2)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: LOSS31.IM rate calculations (group #31)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss31.im-sd
   #+RESULTS: loss31.im-sd
   [[file:/tmp/babel-1752Epe/figure-17521hg.pdf]]

   #+NAME: loss31.im-sd-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss31.im$sd_ln_x ~ paleo.loss31.im$IM, log="", 
          xlab="IM", ylab="sd(ln(Loss))",
	  xlim=c(0.01, 0.30),
          main="Loss-IM Relationship",
          type="p", col=1)

     lines(neo.loss31.im$sd_ln_x ~ neo.loss31.im$IM, col=2)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: LOSS31.IM rate calculations (group #31)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss31.im-sd-zoom
   #+RESULTS: loss31.im-sd-zoom
   [[file:/tmp/babel-1752Epe/figure-1752P9g.pdf]]

** LOSS-EDP
   Read the LOSS-EDP data for group #31:
   #+BEGIN_SRC R   :results output
     paleo.loss31.edp <- read.csv(
         paste(results.dir, "pg-31-edp", sep=""),
         skip=3, header=FALSE, sep="")
     names(paleo.loss31.edp) = c("EDP", "mean_x", "sd_ln_x")

     neo.loss31.edp <- read.csv("example1a_loss_31_edp.txt", 
         header=TRUE, sep="")
   #+END_SRC
  
   #+RESULTS:

   Compare the means and standard deviations:
   #+BEGIN_SRC R 
     diff <- paleo.loss31.edp$mean_x - neo.loss31.edp$mean_x
     denom <- paleo.loss31.edp$mean_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+RESULTS:
   | Max abs(error) is 5.000000e-05 (0.03%). |
   | Mean error is 1.506201e-06 (0.00%).     |

   #+BEGIN_SRC R 
     diff <- paleo.loss31.edp$sd_ln_x - neo.loss31.edp$sd_ln_x
     denom <- paleo.loss31.edp$sd_ln_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n")
   #+END_SRC

   #+RESULTS:
   | Max abs(error) is 5.000000e-04 (0.05%). |
   | Mean error is 4.953020e-06 (0.00%).     |

   Plot the means (Figures [[fig:loss31.edp-mean]] and [[fig:loss31.edp-mean-zoom]]) and
   standard deviation (Figures [[fig:loss31.edp-sd]] and [[fig:loss31.edp-sd-zoom]]):
   #+NAME: loss31.edp-mean
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R
     palette(c("red", "blue", "green"))
     plot(paleo.loss31.edp$mean_x ~ paleo.loss31.edp$EDP, log="xy", 
          xlab="EDP", ylab="Mean(Loss)",
          main="Loss-EDP Relationship",
          type="p", col=1, lwd=5)

     lines(neo.loss31.edp$mean_x ~ neo.loss31.edp$EDP, 
         col=2, lwd=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-EDP rate calculations (group #31)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss31.edp-mean
   #+RESULTS: loss31.edp-mean
   [[file:/tmp/babel-1752Epe/figure-1752NDI.pdf]]

   #+NAME: loss31.edp-mean-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss31.edp$mean_x ~ paleo.loss31.edp$EDP, log="xy", 
          xlab="EDP", ylab="Mean(Loss)",
	  main="Loss-EDP Relationship",
          xlim=c(0.05, 0.10),
          type="p", col=1, lwd=5)

     lines(neo.loss31.edp$mean_x ~ neo.loss31.edp$EDP, 
  	 col=2, lwd=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC
   #+CAPTION: Loss-EDP rate calculations (group #31)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss31.edp-mean-zoom
   #+RESULTS: loss31.edp-mean-zoom
   [[file:/tmp/babel-1752Epe/figure-1752_Cy.pdf]]



   #+NAME: loss31.edp-sd
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue", "green"))
     plot(paleo.loss31.edp$sd_ln_x ~ paleo.loss31.edp$EDP, log="", 
          xlab="EDP", ylab="sd(ln(Loss))",
	  main="Loss-EDP Relationship",
          type="p", col=1, lwd=5)
     lines(neo.loss31.edp$sd_ln_x ~ neo.loss31.edp$EDP, 
  	 col=2, lwd=3)

     points(paleo.loss31.edp$sd_ln_x ~ paleo.loss31.edp$EDP, col=3)

     legend(x="right",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-EDP calculations (group #31)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss31.edp-sd
   #+RESULTS: loss31.edp-sd
   [[file:/tmp/babel-1752Epe/figure-1752ofP.pdf]]


   #+NAME: loss31.edp-sd-zoom
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R 
     palette(c("red", "blue", "green"))
     plot(paleo.loss31.edp$sd_ln_x ~ paleo.loss31.edp$EDP, log="", 
          xlab="EDP", ylab="sd(ln(Loss))",
	  main="Loss-EDP Relationship",
          xlim=c(0.08, 0.12),
          type="p", col=1, lwd=5)

     lines(neo.loss31.edp$sd_ln_x ~ neo.loss31.edp$EDP, 
  	 col=2, lwd=3)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Loss-EDP calculations (group #31)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:loss31.edp-sd-zoom
   #+RESULTS: loss31.edp-sd-zoom
   [[file:/tmp/babel-1752Epe/figure-1752MUs.pdf]]

\clearpage
* Total Loss
  Read the Total Loss data:
  #+BEGIN_SRC R   :results output
    paleo.structloss.c <- read.csv(
        paste(results.dir, "tlossc", sep=""),
         skip=3, header=FALSE, sep="")
    names(paleo.structloss.c) = c("IM", "mean_x", "sd_ln_x")

    paleo.structloss.nc <- read.csv(
        paste(results.dir, "tlossnc", sep=""),
        skip=3, header=FALSE, sep="")
    names(paleo.structloss.nc) = c("IM", "mean_x", "sd_ln_x")

    neo.structloss.c <- read.csv("example1a_loss_c_total", 
        header=TRUE, sep="")

    neo.structloss.nc <- read.csv("example1a_loss_nc_total", 
        header=TRUE, sep="")
  #+END_SRC
  
  #+RESULTS:
** Non-Collapse
   Compare the means and standard deviations:
   #+BEGIN_SRC R
     diff <- paleo.structloss.nc$mean_x -
         neo.structloss.nc$mean_x
     denom <- paleo.structloss.nc$mean_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("mean valus:"),
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),

         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n    ")
   #+END_SRC

   #+RESULTS:
   | mean valus:                          |
   | Max abs(error) is 1.525e-01 (0.67%). |
   | Mean error is -4.376e-03 (-0.02%).   |

   #+BEGIN_SRC R 
     diff <- paleo.structloss.nc$sd_ln_x - 
         neo.structloss.nc$sd_ln_x
     denom <- paleo.structloss.nc$sd_ln_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("standard deviations:"),
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n   ")
   #+END_SRC

   #+RESULTS:
   | standard deviations:                  |
   | Max abs(error) is 6.151e-02 (14.33%). |
   | Mean error is -4.376e-02 (-10.51%).   |

   Plot the mean (Figure [[fig:structloss.nc-mean]]) and standard deviation (Figure
   [[fig:structloss.nc-sd]]):
   #+NAME: structloss.nc-mean
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R
     palette(c("red", "blue"))
     plot(paleo.structloss.nc$mean_x ~
          paleo.structloss.nc$IM, log="",
	  xlim=c(0, 1.5), ylim=c(0, 10E6),
          xlab="IM", ylab="Mean(Loss)", 
          main="Total Loss, No Collapse",
          type="p", col=1, lwd=5)

     lines(neo.structloss.nc$mean_x ~ neo.structloss.nc$IM, 
         col=2, lwd=3)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Mean Total Loss 
   #+CAPTION: (*not* considering collapse)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:structloss.nc-mean
   #+RESULTS: structloss.nc-mean
   [[file:/tmp/babel-1757XZc/figure-17572zh.pdf]]


   #+NAME: structloss.nc-sd
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue"))
     plot(paleo.structloss.nc$sd_ln_x ~ paleo.structloss.nc$IM,
          log="", xlab="IM", ylab="sd(ln(Loss))", 
          main="Total Loss, No Collapse",
          type="p", col=1, lwd=5)
     lines(neo.structloss.nc$sd_ln_x ~ neo.structloss.nc$IM, 
         col=2, lwd=3)
  
     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Standard deviation of total loss
   #+CAPTION: (*not* considering collapse)
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:structloss.nc-sd
   #+RESULTS: structloss.nc-sd
   [[file:/tmp/babel-1757XZc/figure-17576YY.pdf]]


** Collapse
   Compare the means and standard deviations:
   #+BEGIN_SRC R 
     diff <- paleo.structloss.c$mean_x - 
         neo.structloss.c$mean_x
     denom <- paleo.structloss.c$mean_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Mean loss, considering collapse:"),
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n    ")
   #+END_SRC

   #+RESULTS:
   | Mean loss, considering collapse:     |
   | Max abs(error) is 1.203e-01 (0.62%). |
   | Mean error is -1.849e-03 (-0.01%).   |

   #+BEGIN_SRC R 
     diff <- paleo.structloss.c$sd_ln_x - 
         neo.structloss.c$sd_ln_x
     denom <- paleo.structloss.c$sd_ln_x
     denom[denom == 0] <- NA
     diff.pct <- diff / denom

     paste(
         sprintf("Standard Deviation of loss, considering collapse:"),
         sprintf("Max abs(error) is %5.3e (%3.2f%%).",
                 max(abs(diff)),
                 100 * max(abs(diff.pct), na.rm=TRUE)),
         sprintf("Mean error is %5.3e (%3.2f%%).",
                 mean(diff),
                 100 * mean(diff.pct, na.rm=TRUE)),
         sep="\n    ")
   #+END_SRC

   #+RESULTS:
   | Standard Deviation of loss, considering collapse: |
   | Max abs(error) is 4.402e-02 (8.88%).              |
   | Mean error is -1.777e-02 (-3.56%).                |

   Plot the mean (Figure [[fig:structloss.c-mean]]) and standard deviation (Figure
   [[fig:structloss.c-sd]]):
   #+NAME: structloss.c-mean
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R
     palette(c("red", "blue"))
     plot(paleo.structloss.c$mean_x ~ paleo.structloss.c$IM, 
          log="", xlab="IM", ylab="Mean(Loss)",
	  xlim=c(0, 1.5), ylim=c(0, 20E6),
          main="Total Loss, Collapse",
          type="p", col=1, lwd=5)

     lines(neo.structloss.c$mean_x ~ neo.structloss.c$IM, 
         col=2, lwd=3)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Mean of total loss, considering collapse.
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:structloss.c-mean
   #+RESULTS: structloss.c-mean
   [[file:/tmp/babel-1757XZc/figure-1757CLJ.pdf]]


   #+NAME: structloss.c-sd
   #+HEADER: :results graphics
   #+HEADER: :file (org-babel-temp-file "./figure-" ".pdf")
   #+BEGIN_SRC R  
     palette(c("red", "blue"))
     plot(paleo.structloss.c$sd_ln_x ~ paleo.structloss.c$IM, log="", 
          xlab="EDP", ylab="sd(ln(Loss))", main="Total Loss, Collapse",
	  ylim=c(0, max(paleo.structloss.c$sd_ln_x)),
          type="p", col=1, lwd=5)
     lines(neo.structloss.c$sd_ln_x ~ neo.structloss.c$IM, 
  	 col=2, lwd=3)

     legend(x="topright",
          legend=c("Paleo", "Neo"),
          fill=palette())
   #+END_SRC

   #+CAPTION: Standard deviation of loss, considering collapse
   #+ATTR_LaTeX: :width \textwidth*4/4 :placement [h!bt]
   #+NAME: fig:structloss.c-sd
   #+RESULTS: structloss.c-sd
   [[file:/tmp/babel-1752Epe/figure-1752gLO.pdf]]


** Temp								   :noexport:
   EDP-IM relationships:
   #+BEGIN_SRC sh :results output
   for i in $(seq 21); do    
      f=example1a_im_edp_${i}.txt
      min_n=$(head -2 $f | tail -1 | awk -e '{print $1}')
      max_n=$(tail -1 $f | awk -e '{print $1}')
      count_n=$(wc -l $f | awk -e '{print $1 - 1}')

      f=~/SLATv1.15_Public/example1a_collapse/results/edp-im-${i}
      min_p=$(head -4 $f | tail -1 | awk -e '{print $1}')
      max_p=$(tail -2 $f | awk -e 'BEGIN{RS="\r\n"} {print $1}')
      count_p=$(wc -l $f | awk -e '{print $1 - 4}')
      echo $min_n $min_p "; " $max_n $max_p "; " $count_n $count_p
   done
   #+END_SRC

   #+RESULTS:
   #+begin_example
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
#+end_example

   EDP-rate relationships
   #+BEGIN_SRC sh :results output
   for i in $(seq 21); do    
      f=example1a_edp_${i}_rate.txt
      min_n=$(head -2 $f | tail -1 | awk -e '{print $1}')
      max_n=$(tail -1 $f | awk -e '{print $1}')
      count_n=$(wc -l $f | awk -e '{print $1 - 1}')

      f=~/SLATv1.15_Public/example1a_collapse/results/edp-${i}-rate.txt
      min_p=$(head -4 $f | tail -1 | awk -e '{print $1}')
      max_p=$(tail -2 $f | awk -e 'BEGIN{RS="\r\n"} {print $1}')
      count_p=$(wc -l $f | awk -e '{print $1 - 4}')
      echo $min_n $min_p "; " $max_n $max_p "; " $count_n $count_p
   done
   #+END_SRC

   #+RESULTS:
   #+begin_example
   0.001 1.0000E-03 ;  0.15 0.1500 ;  149 149
   0.001 1.0000E-03 ;  0.1 0.1000 ;  149 149
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
#+end_example

   Loss-edp
   #+BEGIN_SRC sh :results output
   for i in $(seq 115); do    
      f=example1a_loss_${i}_edp.txt
      min_n=$(head -2 $f | tail -1 | awk -e '{print $1}')
      max_n=$(tail -1 $f | awk -e '{print $1}')
      count_n=$(wc -l $f | awk -e '{print $1 - 1}')

      f=~/SLATv1.15_Public/example1a_collapse/results/pg-${i}-edp
      min_p=$(head -4 $f | tail -1 | awk -e '{print $1}')
      max_p=$(tail -2 $f | awk -e 'BEGIN{RS="\r\n"} {print $1}')
      count_p=$(wc -l $f | awk -e '{print $1 - 4}')
      echo $i":" $min_n $min_p "; " $max_n $max_p "; " $count_n $count_p
   done
   #+END_SRC

   #+RESULTS:
   #+begin_example
   1: 0.001 1.0000E-03 ;  0.1 0.1000 ;  149 149
   2: 0.001 1.0000E-03 ;  0.1 0.1000 ;  149 149
   3: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   4: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   5: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   6: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   7: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   8: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   9: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   10: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   11: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   12: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   13: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   14: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   15: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   16: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   17: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   18: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   19: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   20: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   21: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 149
   22: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   23: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   24: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   25: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   26: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   27: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   28: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   29: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   30: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   31: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 149
   32: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   33: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   34: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   35: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   36: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   37: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   38: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   39: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   40: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   41: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 149
   42: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   43: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   44: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   45: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   46: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   47: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   48: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   49: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   50: 0.001 1.0000E-03 ;  0.1 0.1000 ;  199 199
   51: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   52: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   53: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   54: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   55: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   56: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   57: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   58: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   59: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   60: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   61: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   62: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   63: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   64: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   65: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   66: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   67: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   68: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   69: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   70: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   71: 0.001 1.0000E-03 ;  0.1 0.1500 ;  199 149
   72: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   73: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   74: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   75: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   76: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   77: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   78: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   79: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   80: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   81: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   82: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   83: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   84: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   85: 0.05 1.0000E-03 ;  5.0 0.1500 ;  199 149
   86: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 149
   87: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   88: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   89: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   90: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   91: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   92: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   93: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   94: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   95: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   96: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 149
   97: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   98: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   99: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   100: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   101: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   102: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   103: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   104: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   105: 0.05 1.0000E-03 ;  5.0 0.1000 ;  199 199
   106: 0.05 1.0000E-03 ;  5.0 0.1500 ;  199 149
   107: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   108: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   109: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   110: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   111: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   112: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   113: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   114: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
   115: 0.05 5.0000E-02 ;  5.0 5.000 ;  199 199
#+end_example

   Loss-im
   #+BEGIN_SRC sh :results output
   for i in $(seq 115); do    
      f=example1a_loss_${i}_im.txt
      min_n=$(head -2 $f | tail -1 | awk -e '{print $1}')
      max_n=$(tail -1 $f | awk -e '{print $1}')
      count_n=$(wc -l $f | awk -e '{print $1 - 1}')

      f=~/SLATv1.15_Public/example1a_collapse/results/pg-${i}-im
      min_p=$(head -4 $f | tail -1 | awk -e '{print $1}')
      max_p=$(tail -2 $f | awk -e 'BEGIN{RS="\r\n"} {print $1}')
      count_p=$(wc -l $f | awk -e '{print $1 - 4}')
      echo $min_n $min_p "; " $max_n $max_p "; " $count_n $count_p
   done
   #+END_SRC

   #+RESULTS:
   #+begin_example
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
   0.01 1.0000E-02 ;  2.5 2.500 ;  199 199
#+end_example

